## Lenguajes de Programaci칩n
### Evaluaci칩n Semanal 3

#### 游닇 Instrucciones

- El semanal podr치 resolverse **en parejas**
- Se deber치 entregar por medio de GitHub Classroom a m치s tardar a las **23:59:59 del martes 27 de agosto de 2024**. **No habr치n pr칩rrogas**. 
- Cualquier duda podr치 extenarse en la clase, por correo o por medio de Telegram en un horario de 9:00 a 18:00.
- Deber치 entregarse en formato LaTeX (pueden encontrar una [plantilla](#) en este mismo repositorio, adicionalmente pueden consultar el siguiente paquete para generar reglas de inferencia: [`bussproofs.sty`](https://ctan.math.illinois.edu/macros/latex/contrib/bussproofs/BussGuide2.pdf))

#### 游 Ejercicios

1. Dadas las siguientes expresiones en sintaxis concreta de nuestro lenguaje **MiniLisp** (a) obtener su sintaxis abstracta, (b) evaluarlas usando las reglas de sem치ntica natural y (c) evaluarlas usando las reglas de sem치ntica estructural. Todas las reglas podr치n consultar en [Nota de Clase 6](https://lambdasspace.github.io/LDP/notas/ldpn06.pdf).

   - `(+ 18 (- 17 (+ 40 5)))`
   - `(- (+ 20 3) (- -18 (+ 50 20)))`

2. Como segundo ejercicio deber치n extener la bater칤a de operaciones de **MiniLisp**, para ello deber치n (a) modificar la gram치tica libre de contexto en notaci칩n EBNF a침adiendo las nuevas construcciones del lenguaje, (b) modificar las reglas de sintaxis abstracta para considerar los nuevos constructores y finalmente (c) extender las reglas de sem치ntica natural y estructural.

   - Especificar un nuevo constructor `*` para la multiplicaci칩n binaria de expresiones aritm칠ticas. Por ejemplo:
     
      ```lisp
      > (* 20 2)
      40
      ```
      
   - Especificar un nuevo constructor `/` para la divisi칩n binaria de expresiones aritm칠ticas. Consideren que no se pueden realizar divisiones entre cero. Por ejemplo: 
     
      ```lisp
      > (/ 20 2)
      10
      > (/ 10 0)
      error: Divisi칩n entre cero
      ```
      
   - Especificar un nuevo constructor `add1` que dada una expresi칩n, incrementa en uno su valor. Por ejemplo:
     
      ```lisp
      > (add1 10)
      11
      ```
      
   - Especificar un nuevo constructor `sub1` que dada una expresi칩n, decrementa en uno su valor. Por ejemplo: 
     
      ```lisp
      > (sub1 10)
      9
      ```
      
   - Especificar un nuevo constructor `sqrt` que dada una expresi칩n, obtiene la ra칤z cuadrada de dicha expresi칩n. Consideren que no se pueden calcular ra칤ces cuadradas de n칰meros negativos. Por ejemplo: 
     
      ```lisp
      > (sqrt 81)
      9
      > (sqrt -2)
      error: Ra칤z negativa
      ```
      
